Repository: blynn/gitmagic
Catalog: pl/omegat-tmp/omegat/project_save.tmx
Source language: de_de
Languages: pl

source: In vielen Fällen kannst du den *--onto* Schalter benutzen um Interaktion zu vermeiden.
pl: W wielu przypadkach możesz skorzystać z przełącznika *--onto* by zapobiec interakcji.

source: In älteren Versionsverwaltungssystemen ist 'checkout' die Standardoperation um Dateien zu bekommen.
pl: W starszych systemach zarządzania wersją polecenie CHECKOUT stanowi standardową operacje pozyskania danych.

source: Indizierung
pl: Indeksowanie

source: Initialer 'Commit'
pl: Pierwszy 'commit'

source: Integrität
pl: Integralność

source: Intelligenz
pl: Inteligencja

source: Irgendwann wirst du dann mit den anderen synchronisieren wollen, dann gehe in das Originalverzeichnis, aktualisiere mit dem anderen Versionsverwaltungssystem und gib ein:
pl: Kiedyś zechcesz zsynchronizować pracę, idź więc do orginalnego katakogu zaktualizuj go najpierw z tym innym systemem kontroli wersji i wpisz:

source: Irgendwelche 'Merge'-Konflikte sollten dann aufgelöst und erneut 'commitet' werden:
pl: Jeżli wystąpią jakiekolwiek konflikty MERGE, powinny być usunięte in na nowo COMMIT

source: Irgendwo speicherte ein Server alle gespeicherten Spiele, sonst niemand.
pl: Jeden serwer zapamiętywał wszystkie gry, nikt inny.

source: Irren ist menschlich und so kann es vorkommen, dass du zurück zu Teil I willst um einen Fehler zu beheben.
pl: Błądzenie jest ludzkie i może się zdażyć, że chcecie wrócić do części 1 i wprowadzić poprawki.

source: Je mehr gespeicherte Spiele benötigt werden, desto mehr Kommunikation ist erforderlich.
pl: Czym więcej gier zostało zapamiętanych, tym więcej wymaga to komunikacji.

source: Jede Datei einzeln nachzuprüfen ist frustrierend und ermüdend.
pl: Sprawdzenie każdej danej z osobna jest frustrujące i męczące zarówno.

source: Jede Datei in `.git/objects` ist ein 'Objekt'.
pl: Każdy plik w `.git/objects` jest 'objektem'.

source: Jeder 'Clone' deines Codes ist eine vollwertige Datensicherung.
pl: Ponieważ każdy klon twojego kodu jest pełnowartościową kopią bezpieczeństwa

source: Jeder 'Commit' ab jetzt führt deine Dateien auf einen anderen Weg, dem wir später noch einen Namen geben können.
pl: Kazdy wykonyny od teraz 'commit' prowadzi twoje dane inna droga, ktorej później jeszcze mozemy nadac nazwe.

source: Jeder 'Commit' enthält Name und eMail-Adresse des Autors, welche mit *git log* angezeigt werden.
pl: Każdy 'commit' otrzymuje nazwę i adres email autora, które zostaną pokazane w *git log*.

source: Jeder Klon könnte einen solchen Zähler bereitstellen, aber der wäre vermutlich nutzlos, denn nur der Zähler des zentralen 'Repository' ist für alle relevant.
pl: Każdy klon mógłby posiadać taki licznik, jednak byłby on prawdopodobnie bezużyteczny, ponieważ tylko licznik centralnego repozytoriom ma znaczenie.

source: Jeder Spieler hatte nur ein paar gespeicherte Spiele auf seinem Rechner.
pl: Każdy gracz posiadał jedynie kilka zapamiętanych na swoim komputerze gier.

source: Jeder Spielstand, der ab jetzt gesichert wird, entsteht in dem separaten 'Branch', welcher der alternative Realität entspricht.
pl: Każdy stan, który od teraz zostanie zapamiętany, powstanie w osobnym BRANCH, który odpowiada alternatywnej rzeczywitości.

source: Jeder initiale 'Commit' ist dann stillschweigend ein Abkömmling dieses Null-'Commits'.
pl: Każdy inicjujący 'commit' byłby pochodną tego zerowego 'commit'.

source: Jeder kann herausfinden wer sonst gerade an einer Datei arbeitet, indem er beim zentralen Server anfragt, wer die Datei zum Bearbeiten markiert hat.
pl: Każdy może sprawdzić kto właśnie nad jakim plikiem pracuje, sprawdzając na serwerze po prostu kto zaznaczył tą daną do obróbki

source: Jeder kann oberflächliche Klone erstellen, die nur wenig oder gar nichts vom Verlauf des Projekts enthalten.
pl: Każdy może dokonywać pobierznych klonów, które mało co lub wcale nie mają nic do czynienia z przebiegiem projektu.

source: Jedes mal ist die Ausgabe ein 'Patch' der mit *git apply* eingespielt werden kann.
pl: Za kazdym razem uzyskane informacje sa PATCH ktory poprzez *git applly* moze zostac wgrany

source: Jedoch kann es nicht alle Fälle abdecken, aber es leistet ordentliche Arbeit und diese Eigenschaft wird immer besser.
pl: Mimo iż wykonuje kawał dobrej roboty, a ta właściwość staje się coraz lepsza, nie potrafi niestety jeszcze poradzić sobie z wszystkimi możliwymi przypadkami.

source: Jegliche Version Deiner Daten wird in der Objektdatenbank gehalten, welche im Unterverzeichnis `.git/objects` liegt; Die anderen Orte in `.git/` enthalten weniger wichtige Daten: den Index, 'Branch' Namen, Bezeichner ('tags'), Konfigurationsoptionen, Logdateien, die Position des aktuellen 'HEAD Commit' und so weiter.
pl: Każda wersja twoich danych jest przechowywana w objektowej bazie danych, która znajduje sie w podkatalogu `.git/objects`. Inne miejsca w `.git/` posiadają mniej ważne dane, jak indeks, nazwy gałęzi ('branch'), tagi, logi,konfigurację, aktualną pozycję HEAD i tak dalej.

source: Jemanden zu fotografieren stiehlt nicht dessen Seele.
pl: Fotografując kogoś nie kradziemy jego duszy.

source: Jetzt lass uns das Problem etwas komplizierter machen.
pl: Skomplikujmy teraz trochę cały ten problem.

source: KOPF-Jagd
pl: Łowcy głów

source: Keine Sorge, gib ein:
pl: Nie ma sprawy, wpisz polecenie:

source: Keine Sorge: Für solche Anweisungen sichert Git den original HEAD als Bezeichner mit dem Namen ORIG_HEAD und Du kannst gesund und munter zurückkehren mit:
pl: Nie ma sprawy: Przy wykonywaniu takich poleceń GIT archiwizuje orginalny HEAD jako indentyfikator o nazwie ORIG_HEAD a ty możesz bezproblemowo wrócić używając:

source: Klassische Quellcodeverwaltung
pl: Klasyczne zarządzanie kodem źródłowym

source: Kleinere Bearbeitungen sollten auch nur minimale Änderungen an so wenig Dateien wie möglich bewirken.
pl: Małe zmiany w projekcie powinny pociągać tylko minimalne zmiany na tak wąskiej grupie plików, jak to tylko możliwe.

source: Kleinere Verfehlungen sind Leerzeichen am Zeilenende und ungelöste 'merge'-Konflikte: obwohl sie harmlos sind, wünschte ich, sie würden nie in der Öffentlichkeit erscheinen.
pl: Mniejszymi usterkami mogą być spacje na końcu linii i nierozwiązane konflikty poleceń 'merge': mimo iż nie są groźne, życzyłbym sobie, by nigdy nie wystąpiły publicznie.

source: Kontinuierlicher Arbeitsfluss
pl: Nieprzerywany ciąg pracy

source: Kopiere alle +txt+-Dateien aus dem "en"-Verzeichnis in das neue Verzeichnis und übersetze diese.
pl: Skopiuj wszystkie pliki +txt+ z katalogu "en" do nowoutworzonego katalogu.

source: Kurz gesagt, Git hält Deine Daten in dem `.git/objects` Unterverzeichnis, wo Du anstelle von normalen Dateinamen nur Identitätsnummern findest.
pl: Krótko mówiąc, Git przechowuje twoje dane w podkatalogu `.git/objects`, gdzie zamiast nazw plików znajdziesz numery identyfikacyjne.

source: Kurz gesagt, so lange die 20 Byte, welche den SHA1-Hash-Wert des letzen 'Commit' repräsentieren sicher sind, ist es unmöglich ein Git 'Repository' zu fälschen.
pl: Krótko mówiąc, doputy reprezentujące ostatni commit 20 bajtów są zabezpieczone, przefałszowanie repozytorium Gita nie jest możliwe.

source: Kurzum, während du lernst mit Git umzugehen, 'pushe' nur, wenn das Ziel ein 'bare Repository' ist; andernfalls benutze 'pull'.
pl: Krótko mówiąc, podczas gdy uczysz się korzystania z GIR, korzystaj z polecenia PUSH tylko, gdy cel jest BARE REPOSITORY, w wszystkich innych wypadkach z polecenia PULL

source: Lade Git herunter, compiliere und installiere es unter Deinem Benutzerkonto und erstellen ein 'Repository' in Deinem Webverzeichnis:
pl: Zładuj git, skompiluj i zainstaluj pod własnym kontem oraz utwórz repozytorium w twoim katalogu strony internetowej.

source: Lasse den -global Schalter weg um diese Einstellungen für das aktuelle 'Repository' zu setzen.
pl: Jeśli opóścisz przełącznik '--global' zmiany zostaną zastosowane wyłącznie do aktualnego repozytorium.

source: Lasst uns einen Blick riskieren:
pl: Zaryzykujmy spojrzenie:

source: Leere Unterverzeichnisse
pl: Puste katalogi

source: Leere Unterverzeichnisse können nicht überwacht werden.
pl: Nie ma możliwości wersjonowania pustych katalogów.

source: Leider gibt es noch ein paar Problemfälle.
pl: Niestety występuje jeszcze kilka innych problemów.

source: Leider kenne ich keine solche Erweiterung für Git.
pl: Niestety nie są mi znane takie rozszerzenia dla GIT.

source: Leute machen kleine Änderungen von Version zu Version.
pl: Ludzie robią jednak pomniejsze zmiany z wersji na wersję.

source: Lizenz
pl: Lizencja

source: Lokale Änderungen zum Schluß
pl: Końcowe lokalne zmian

source: Machst Du eine Serie von unabhängigen Änderungen, weil es Dein Stil ist?
pl: Przeprowadzasz serię niezależnych zmian, bo jest to w twoim stylu?

source: Macht man das regelmäßig, kann man leicht vergessen, welcher 'Commit' zuletzt gesendet wurde.
pl: Jeśli robi się to regularnie, łatwo można zapomnieć, który 'commit' został wysłany ostatnio.

source: Man kann das aber auch in einem einzigen Schritt ausführen mit:
pl: Można to także wykonać za jednyym zamachem:

source: Man muss vom Hauptserver das alte gespeicherte Spiel anfordern.
pl: Za każdym razem trzeba ściągnąć wszystkie dane z serwera.

source: Manchmal möchtest du einfach zurück gehen und alle Änderungen ab einem bestimmten Zeitpunkt verwerfen, weil sie falsch waren.
pl: Czasami zechcesz po prostu cofnac sie w czasie i zapomniec o wszystkich zmianach ktorych dokonales

source: Mehrere 'Remotes'
pl: Więcej serwerów

source: Mein 'Commit' ist zu groß!
pl: Mój 'commit' jest za duży!

source: Meine Dankbarkeit gilt auch vielen anderen für deren Unterstützung und Lob.
pl: Chcałbym podziękować również wszystkim innym za ich pomoc i dobre słowo.

source: Meine Einstellungen
pl: Moje ustawienia

source: Meistens befindet es sich auf einem Server, der nicht viel tut außer Daten zu verbreiten.
pl: Często znajduje się ono na serwerze, który nie robi dużo więcej, niż rozdzielanie danych.

source: Menschen sind nicht gut im Kontextwechsel.
pl: Ludzie nie potrafią dobrze dostosować się do częstej zmiany kontekstu.

source: Mercurial ist ein ähnliches Versionsverwaltungssystem, das fast nahtlos mit Git zusammenarbeiten kann.
pl: Mercurial to podobny system kontroli wersji, który prawie bezproblemowo potrafi pracować z GIT

source: Mischmasch Reorganisieren
pl: Reorganizacja chaosu

source: Mit Git ist 'Mergen' so einfach, dass du gar nicht merkst, wenn es passiert.
pl: Z Git 'merge' jest tak proste, ze wogóle nie zauwazysz, gdy to nastepuje

source: Mit anderen Worten, es verwaltet die Geschichte eines Projekts, enthält aber niemals einen Auszug irgendeiner beliebigen Version.
pl: Innymi słowami, zarządza historią projektum, nie otrzymuje jednak nigdy jakiejkolwiek wersji

source: Mit anderen Worten, nach dem Abrufen eines alten Stands versetzt dich Git automatisch in einen neuen, unbenannten 'Branch', der mit *git checkout -b* benannt und gesichert werden kann.
pl: Innymi slowami, po przywolaniu starego stanu Git automatychnie zamienia sie w nowy, nienazwany 'branch', ktory poleceniem *git checout -b* uzyska nazwe i zostanie zapamietany.

source: Mit anderen Worten, wir wollen ihre 'Branches' untersuchen ohne dass deren Änderungen in unser Arbeitsverzeichnis einfließen.
pl: Innymi słowami, chcemy zbadać ich branches bez importowania ich zmian do naszego katalogu roboczego.

source: Mit der Zeit entdecken Kryptographen immer mehr Schwächen an SHA1. Schon heute wäre es technisch machbar für finanzkräftige Unternehmen Hash-Kollisionen zu finden.
pl: Z biegiem czasu kryptografowie odkrywają coraz więcej słabości systemu SHA1. Już dzisiaj byłoby możliwe dla przeciębiostw dysponujących odpowiednimi zosobami finansowymi znaleźć kolizje w hash-ach

source: Mit der Zeit können einige davon zu offiziellen Anweisungen befördert werden.
pl: Z czasem niektóre z nich mogą uzyskać status oficjalnych poleceń.

source: Mit der `hg-git`-Erweiterung kann ein Benutzer von Mercurial verlustfrei in ein Git 'Repository' 'pushen' und daraus 'pullen'.
pl: Korzystając z rozszerzenia hg-git użytkownik Mercurial jest w stanie prawie bez większych strat PUSH i PULL ze składem GIT.

source: Mit diesem Zauberwort verwandeln sich die Dateien in deinem Arbeitsverzeichnis plötzlich von einer Version in eine andere.
pl: Tym magicznym slowem zmienisz dane w swoim katalogu roboczym z jednej wersji w inna.

source: Mit ein bisschen Handarbeit kannst Du Git anpassen, damit es Deinen Anforderungen entspricht.
pl: Przykładając trochę ręki możesz adoptować git do twoich własnych potrzeb.

source: Mit ein paar Tastendrücken kannst Du mehrere geänderte Dateien für den 'Commit' hinzufügen ('stage') oder entfernen ('unstage') oder Änderungen einzelner Dateien nachprüfen und hinzufügen.
pl: Kilkoma naciśnięciami klawiszy możesz wiele zmienionych plików dodać ('stage') albo usunąć z 'commit' ('unstage'), jak również sprawdzić, czy dodać poszczególne dane.

source: Mit einer Webmail Anwendung musst Du eventuell ein Button anklicken um die eMail in ihrem rohen Originalformat anzuzeigen, bevor Du den 'Patch' in eine Datei sicherst.
pl: Jeśli stosujesz webmail musisz ewentualnie kliknąć, by pokazać treść niesformatowaną, zanim zapamiętasz patch do pliku.

source: Mit einigen Versionsverwaltungssystemen ist das Erstellen eines 'Branch' einfach, aber das Zusammenfügen ('Mergen') ist schwierig.
pl: Za pomoca niektorych systemow kontroli wersji utworzenie nowego 'branch' moze i jest proste, jednak pozniejsze zespolenie ('merge') trudne.

source: Mit etwas Glück, wenn Git's Verbreitung zunimmt und mehr Anwender nach dieser Funktion verlangen, wird sie vielleicht implementiert.
pl: Przy odrobinie szczęścia, jeśli Git jeszcze bardziej sie upowszechni i więcej użytkowników żądać będzie tej funkcji, to jest być może zostanie dodana.

source: Mit geeigneten Skripten kannst Du das auch mit Git hinkriegen.
pl: Używając odpowiednich skryptów uda ci się to również przy pomocy GIT.

source: Mit zentraler Versionsverwaltung müssen wir eine neue Arbeitskopie vom Server herunterladen.
pl: Przy centralnej kontroli wersji musielibysmy nowa kopie robocza pozyskac ze serwera.

source: Mit zpipe, ist es einfach den SHA1-Hash-Wert zu prüfen:
pl: Za pomocą zpipe łatwo sprawdzić klucz SHA1:

source: Mittlerweile solltest Du Dich in den *git help* Seiten zurechtfinden und das meiste verstanden haben.
pl: W międzyczasie powinieneś umieć odnaleźć się na stronach *git help* i potrafić większość zrozumieć.

source: Multitasking mit Lichtgeschwindigkeit
pl: Multitasking z prędkością światła

source: Musst Du während eines Notfalls improvisieren?
pl: Musisz improwizować w nagłym wypadku?

source: Möglicherweise reicht ORIG_HEAD nicht aus.
pl: Może się zdarzyć, że ORIG_HEAD nie wystarczy.

source: Nach dem 'Clonen' eines 'Repositories', wird *git push* oder *git pull* automatisch auf die original URL zugreifen.
pl: Po sklonowaniu repozytorium, polecenia *git push* albo *git pull* będą automatycznie wskazywały na orginalne URL.

source: Nach dem Bearbeiten sichert der Entwickler die Änderungen lokal:
pl: Po dokonaniu edycji programista zapamiętuje zmiany lokalnie:

source: Nach ein paar Durchläufen wird dich diese binäre Suche zu dem 'Commit' führen, der die Probleme verursacht.
pl: Po kilku przejściach doprowadzą cię te poszukiwania do 'commit', który jest odpowiedzialny za kłopoty.

source: Nach einer Weile wirst du feststellen, dass du regelmäßig kurzlebige 'Branches' erzeugst, meist aus dem gleichen Grund: jeder neue 'Branch' dient lediglich dazu, den aktuellen Stand zu sichern, damit du kurz zu einem alten Stand zurück kannst um eine vorrangige Fehlerbehebung zu machen oder irgendetwas anderes.
pl: Po jakimś czasie stwierdzisz, że ciągle tworzysz krótko żyjące BRANCHES, w wiekszości z tego samego powodu: każdy nowy BRANCH służy jedynie do tego, by zabezpieczyć aktualny stan,, aby móc wrócić do jednego z poprzednich punktów i poprawić jakieś priorytetowe błędy czy cokolwiek.

source: Nach einer längeren Sitzung hast du einen Haufen 'Commits' gemacht.
pl: Po dłuższej sesji zrobiłeś całą masę 'commits'.

source: Nachdem ich einen Zweig abgerufen habe, benutze ich Git Anweisungen um durch die Änderungen zu navigieren und zu untersuchen, die idealerweise gut organisiert und dokumentiert sind.
pl: Gdy przywołałem moją gałęź korzystam z poleceń Gita dla nawigacji i kontroli zmian, które najłepiej gdy są dobrze zorganizowane i udokumentowane.

source: Natürlich funktioniert der Trick für fast alles, nicht nur Skripts.
pl: Oczywiscie ten trick funkcjonuje ze wszystkim, nie tylko ze skryptami

source: Natürlich können deine Bedürfnisse und Wünsche ganz anders sein und vielleicht bist du mit einem anderen System besser dran.
pl: Oczywiście może się okazać, że twoje potrzeby i oczekiwania są zupełnie inne i być może wygodniej jest tobie z zupełnie innym systemem.

source: Natürlich sind dann viele Git Funktionen nicht verfügbar und Änderungen müssen als 'Patches' übermittelt werden.
pl: Oczywiście w takim wypadku wiele funkcji GIT nie bedzie dostępnych a zmiany muszą być przekazywane w formie 'patch'.

source: Natürlich wird der Quelltext in einem Git 'Repository' gehalten und kann abgerufen werden durch:
pl: Oczywiście, tekst źródłowy znajduje się w repozytorium Git i może zostać powielone przez:

source: Nehmen wir an du willst parallel an mehreren Funktionen arbeiten.
pl: Załóżmy, że chcesz pracować równocześnie nad wieloma funkcjami

source: Nehmen wir jetzt an, das vorherige Problem ist zehnmal schlimmer.
pl: Możemy teraz założyć, że poprzedni problem będzie 10 razy gorszy.

source: Netzwerkressourcen sind einfach teurer als lokale Ressourcen.
pl: Zasoby sieciowe są po prostu droższe niż zasoby lokalne.

source: Nicht nur des aktuellen Stand, sondern der gesamten Geschichte.
pl: Nie tylko jedo aktualny stan, lecz również jego całą historię.

source: Nichts könnte weiter von der Wahrheit entfernt sein.
pl: Nic nie jest bardziej oddalone od rzeczywistości.

source: Nichtsdestotrotz, abgesehen von geschickten Verpackungstricks um Speicherplatz zu sparen und geschickten Indizierungstricks um Zeit zu sparen, wissen wir nun, wie Git gewandt ein Dateisystem in eine Datenbank verwandelt, das perfekt für eine Versionsverwaltung geeignet ist.
pl: Tym niemniej, abstrahując od udanych trików pakujących, by oszczędnie odnosić się z pamięcią i udanych trików indeksujących by zaoszczędzić czas, wiemy jak Git sprawnie przemienia system danych i bazę danych, co jest optymalne dla kontroli wersji.

source: Normalerweise füllt man ein Formular auf einer Website aus.
pl: Zwykle konieczne jest wypełnienie formulaża online na stronie internetowej usługodawcy

source: Normalerweise hat ein 'Commit' genau einen Eltern-'Commit', nämlich den vorhergehenden 'Commit'.
pl: Zazwyczaj kazdy 'commit' posiada rodzica-'commit', a mianowicie poprzedni 'commit'.

source: Normalerweise können wir den Index ignorieren und so tun als würden wir direkt aus der Versionsgeschichte lesen oder in sie schreiben.
pl: Normalnie możemy ignorować indeks i udawać, że czytamy bezpośrednio z historii wersji lub do niej zapisujemy.

source: Normalerweise machen wir einen *pull* weil wir die letzten 'Commits' abrufen und einbinden wollen.
pl: W normalnym wypadku wykonalibyśmy *pull*, bo chcielibyśmy przywołać również ostatnie 'commmits'.

source: Normalerweise wird ein Skript, das diese Anweisung benutzt, hastig zusammengeschustert und einmalig ausgeführt um das Projekt in einem einzigen Lauf zu migrieren.
pl: Często taki skrypt pisany jest pośpiesznie i służy do jednorazowego wykorzystania, aby tylko w jednym przebiegu udało się migracja projektu.

source: Normalerweise ändern sich immer nur wenige Dateien zwischen zwei Versionen und die Änderungen selbst sind oft nicht groß.
pl: W więlszości przypadków tylko niewiele danych ulega zmianie pomiędzy dwoma wersjami, a same zmiany nie są zbyt obszerne.

source: Nun bist du wieder im `master` 'Branch', mit Teil II im Arbeitsverzeichnis.
pl: Znajdujesz się znowu w `master` 'branch', z częścią II w katalogu roboczym.

source: Nun bricht Git einen 'Commit' ab, wenn es überflüssige Leerzeichen am Zeilenende oder ungelöste 'merge'-Konflikte entdeckt.
pl: I już 'commit' przerywa, jeśli odkryje niepotrzebne spacje na końcu linii albo nierozwiązane konflikty 'merge'.

source: Nun gehe in das neue Verzeichnis und arbeite dort mit Git nach Herzenslust.
pl: Przejdź teraz do nowego katalogu i pracuj według upodobania.

source: Nun gib ein:
pl: Podajemy teraz;

source: Nun haben wir einen 'Branch' vom zweiten 'Repository' eingebunden und wir haben einfachen Zugriff auf alle 'Branches' von allen 'Repositories':
pl: Teraz przyłączyliśmy jeden branch z dwóch repozytorii i uzyskaliśmy łatwy dostęp do wszystkich branch z wszystkich repozytorii.

source: Nun kannst Du Deine Arbeit jederzeit wie folgt überprüfen:
pl: Teraz możesz swoją pracę w każdej chwili sprawdzić:

source: Nun kannst Du Deine letzten Änderungen über SSH von jedem 'Clone' aus veröffentlichen.
pl: Od teraz możesz publikować aktualizacje z każdego klonu poprzez SSH.

source: Nun kannst du Fehler beheben, Änderungen vom zentralen 'Repository' holen ('pull') und so weiter.
pl: Teraz możesz poprawiać błędy, zładować zmiany z centralnego REPOSITORY (PULL) i tak dalej.

source: Nun kannst du überall wild temporären Code hinzufügen.
pl: Teraz mozesz wszedze wprowadzac na dziko kod tymczasowy.

source: Nun können wir die ganze Geschichte erzählen: Die Dateien ändern sich zu dem angeforderten Stand, aber wir müssen den 'Master Branch' verlassen.
pl: Teraz mozemy opowiedziec cala historie: Pliki zmieniaja die do wymaganego stanu, jednak musimy opuscic 'master branch'.

source: Nun müsstest Du die Datei +.git/objects/05/b217bb859794d08bb9e4f7f04cbda4b207fbe9+ sehen, denn das ist der SHA1-Hash-Wert ihres Inhalts:
pl: Powinnaś zobaczyć teraz plik +.git/objects/05/b217bb859794d08bb9e4f7f04cbda4b207fbe9+, ponieważ jest to klucz SHA1 jego zawartości.

source: Nun stell dir ein ganz kompliziertes Computerspiel vor.
pl: Wyobraź sobie teraz bardzo skomplikowaną grę komputerową.

source: Nun stell dir vor beide, Alice und Bob, machen Änderungen in der selben Zeile.
pl: Wyobraź sobie jednak, że Alicja i Bob dokonują zmian w tej samej lini.

source: Nur Kleinigkeiten.
pl: To szczegół.

source: Nur zu, aber speichere deinen aktuellen Stand vorher lieber nochmal ab:
pl: Nie ma sprawy, jednak najpierw zabezpiecz dane.

source: Obwohl das Arbeitsverzeichnis unverändert bleibt, können wir nun jeden 'Branch' aus jedem 'Repository' in einer Git Anweisung referenzieren, da wir eine lokale Kopie besitzen.
pl: Mimo, że nasz katalog pozostał bez zmian, możemy teraz referować z każdego repozytorium poprzez polecenia Gita, ponieważ posiadamy lokalną kopię.

source: Obwohl es extrem lästig ist, wenn es die Kommunikation mit einem zentralen Server erfordert, so hat es doch zwei Vorteile:
pl: Mimo że jest to bardzo uciążliwe gdy wymaga ciągłej komunikacji z serwerem centralnym, posiada to też swoje zalety:

source: Obwohl ich nur unregelmäßig Beiträge erhalte, glaube ich, dass diese Methode sich auszahlt.
pl: Mimo, iż dość rzadko otrzymuję posty, jestem zdania, że ta metoda się opłaca.

source: Obwohl sie automatisch über Bord geworfen werden, wenn ihre Gnadenfrist abgelaufen ist, wollen wir sie nun löschen, damit wir unserem Beispiel besser folgen können.
pl: Mimo iż automatycznie zostaną usunięte po upłynięciu okresu łaski, chcemy się ich pozbyć od zaraz, aby lepiej prześledzić następne przykłady.

source: Oder Du kannst schauen, was auf dem 'Branch' ``experimentell'' los war:
pl: Możesz też sprawdzić co działo się w 'Branch' ``experimental''

source: Oder anders gesagt, du spiegelst den zentralen Server.
pl: Lub inaczej mówiąc, odzwierciedlasz zentralny server.
